In [1]:
import pandas as pd
df = pd.read_csv("finance_analytics_dataset.csv")

In [2]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 120 entries, 0 to 119
Data columns (total 8 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   Transaction_ID             120 non-null    int64
 1   Date                       120 non-null    object
 2   Account_Type               120 non-null    object
 3   Transaction_Type           120 non-null    object
 4   Category                   120 non-null    object
 5   Amount_EUR                 120 non-null    float64
 6   Payment_Method             120 non-null    object
 7   Balance_After_Transaction  120 non-null    float64
dtypes: float64(2), int64(1), object(5)
memory usage: 7.6+ KB

In [3]:
df.shape

(120, 8)

In [4]:
df["Transaction_Type"].value_counts()

Transaction_Type
Debit     70
Credit    50
Name: count, dtype: int64

In [5]:
df.groupby("Transaction_Type")["Amount_EUR"].sum()

Transaction_Type
Credit    78259.27
Debit     94357.20
Name: Amount_EUR, dtype: float64

In [6]:
df[df["Transaction_Type"] == "Debit"] \
  .groupby("Category")["Amount_EUR"].sum() \
  .sort_values(ascending=False)

Category
Rent             20240.45
Salary           15084.88
Shopping         14988.15
Transport        12929.77
Entertainment    11250.82
Utilities        10950.89
Groceries         8912.24
Name: Amount_EUR, dtype: float64

In [7]:
df["Date"] = pd.to_datetime(df["Date"])

In [8]:
df["Month"] = df["Date"].dt.to_period("M")
monthly_spending = df[df["Transaction_Type"]=="Debit"] \
    .groupby("Month")["Amount_EUR"].sum()
monthly_spending

Month
2024-01    21098.02
2024-02    26621.19
2024-03    31441.34
2024-04    15196.65
Freq: M, Name: Amount_EUR, dtype: float64

In [9]:
#Data Cleaning

In [10]:
df.isnull().sum()

Transaction_ID               0
Date                         0
Account_Type                 0
Transaction_Type             0
Category                     0
Amount_EUR                   0
Payment_Method               0
Balance_After_Transaction    0
Month                        0
dtype: int64

In [11]:
df.duplicated().sum()

np.int64(0)

In [12]:
df.dtypes

Transaction_ID                        int64
Date                         datetime64[ns]
Account_Type                         object
Transaction_Type                     object
Category                             object
Amount_EUR                          float64
Payment_Method                       object
Balance_After_Transaction           float64
Month                             period[M]
dtype: object

In [13]:
df["Date"] = pd.to_datetime(df["Date"])

In [14]:
df["Amount_EUR"].describe()

count     120.000000
mean     1438.470583
std       870.628518
min        62.890000
25%       648.227500
50%      1502.185000
75%      2125.050000
max      2971.710000
Name: Amount_EUR, dtype: float64

In [15]:
df["Year"] = df["Date"].dt.year
df["Month"] = df["Date"].dt.month
df["Month_Name"] = df["Date"].dt.month_name()

In [16]:
df["Cash_Flow"] = df["Transaction_Type"].apply(
    lambda x: "Expense" if x == "Debit" else "Income"
)

In [17]:
df["High_Value"] = df["Amount_EUR"].apply(
    lambda x: "Yes" if x > 1000 else "No"
)

In [18]:
df.head()
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 120 entries, 0 to 119
Data columns (total 13 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   Transaction_ID             120 non-null    int64
 1   Date                       120 non-null    datetime64[ns]
 2   Account_Type               120 non-null    object
 3   Transaction_Type           120 non-null    object
 4   Category                   120 non-null    object
 5   Amount_EUR                 120 non-null    float64
 6   Payment_Method             120 non-null    object
 7   Balance_After_Transaction  120 non-null    float64
 8   Month                      120 non-null    int32
 9   Year                       120 non-null    int32
 10  Month_Name                 120 non-null    object
 11  Cash_Flow                  120 non-null    object
 12  High_Value                 120 non-null    object
dtypes: datetime64[ns](1), float64(2), int32(2), int64(1), object(7)
memory usage: 11.4+ KB

In [19]:
df.groupby("Cash_Flow")["Amount_EUR"].sum()

Cash_Flow
Expense    94357.20
Income     78259.27
Name: Amount_EUR, dtype: float64

In [20]:
df[df["Cash_Flow"] == "Expense"] \
  .groupby("Category")["Amount_EUR"] \
  .sum() \
  .sort_values(ascending=False)

Category
Rent             20240.45
Salary           15084.88
Shopping         14988.15
Transport        12929.77
Entertainment    11250.82
Utilities        10950.89
Groceries         8912.24
Name: Amount_EUR, dtype: float64

In [21]:
df[df["Cash_Flow"] == "Expense"] \
  .groupby("Month_Name")["Amount_EUR"] \
  .sum()

Month_Name
April       15196.65
February    26621.19
January     21098.02
March       31441.34
Name: Amount_EUR, dtype: float64

In [22]:
df["High_Value"].value_counts()

High_Value
Yes    80
No     40
Name: count, dtype: int64

In [ ]:
### Key Insights from EDA

1. Monthly expense analysis shows that March had the highest spending, indicating a potential seasonal spike.
2. February also recorded high expenses, while April showed comparatively lower spending.
3. A large proportion of transactions (around 67%) are classified as high-value, indicating significant financial outflow risk.

In [23]:
df.to_excel("cleaned_finance_data.xlsx", index=False)